Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 他正要将一枚白子落在棋盘上，叹息一声，原本早有定数的棋子生根处，儒士突然开始举棋不定，他收回手后，棋子却依旧悬停空中，距离棋盘仍有寸余高度。
en_us: Right as he was about to place a white stone onto the go board, he suddenly heaved a faint sigh. Even though he was following a manual of set moves, he suddenly seemed to have grown rather hesitant about where to place the stone down, and in the end, he withdrew his hand, but the stone was still hovering in mid-air over an inch above the go board.

source: 他此时的样子有些古怪，一手提着剑尖，一手横拿着剑身。
en_us: At this moment, he was looking rather strange, pinching the tip of the saber between two of the fingers on one hand, while holding the blade of the sword in the palm of his other hand.

source: 他没有转头，沉声道：“好自为之。”
en_us: Without turning around, Mr. Qi said in a solemn voice, "You're on your own now."

source: 他犹豫了一下，还是解释道：“外界都传齐先生在他恩师败落之后，境界跌落，心境破碎，所以才答应被贬谪到这座小天地，虽然时时刻刻承受天道威压的侵蚀，可是能够为所欲为。我看啊，未必。”
en_us: He hesitated for a moment before explaining, "Everyone in the outside world is spreading the rumor that Mr. Qi's cultivation base has declined and that his mental state has collapsed after his master's reputation was damaged. Thus, he agreed to be banished to this small world. Even though he had to endure the constant erosion from the might of heaven and earth, he can still act wantonly and as he pleases. In my view, however, this isn't necessarily the case."

source: 他甚至都没有机会，伸手去触发腰间玉带的隐秘机关，他腰间所系的白玉腰带，实则是一条地蛟之属的残余精魄，
en_us: He didn't even have the chance to activiate the hidden mechanism on his jade belt. As it turned out, the white jade belt around his waist was actually formed by the remants of an earth dragon's soul.

source: 他用老烟杆往石拱桥那边一指，“之所以如此，根源不在于你辖境小，而在于你的地盘被拦腰斩断了，瞧见那座桥没，就是它把你的未来香火斩断了，你现在只要能够从桥底下游过去，就能有一份大前程。你所处的这条小溪，将来会成为许多重要河流的源头，别说是一头青丝长不过数百里的下等河神，就是被大骊敕封为江神，发丝长达几千里，也不难。”
en_us: He pointed his pipe in the direction of the stone bridge as he continued, "The reason for this isn't because the territory under your jurisdiction is too small. Instead, it's because your territory has been severed. You see that bridge over there? That thing is what's placing this limit on you. All you have to do is swim under the bridge, and you'll have a bright future ahead. This small creek that you're in right now will become the origin of many important rivers in the future, and once that happens, not only will you be sure to attain the river god status and have your hair extend to hundreds of kilometers in length, it'll be entirely possible for you to become a great river god with your hair extending to thousands of kilometers in length."

source: 他留意到马苦玄总共捡了五颗石子，四颗握在左手，一颗在右手。
en_us: He was observing Ma Kuxuan the entire time, and he noticed that Ma Kuxuan had picked up five stones, with four in his left hand and one in his right.

source: 他的人生总是这样，真正在意的人，好像如何也挽留不住。
en_us: Life had always treated him like this. It was as if the people who he cared about would always leave his side no matter what he did.

source: 他的到来，就像过江龙闯入了yi座小湖，地头蛇们哪怕谈不上如何畏惧，面对宋长镜这种人，谁都会拿出该有的恭谨姿态。
en_us: His arrival was akin to a flood dragon crashing into a small lake. Even though the powerful clans in the small town weren't especially afraid of him, they still had to at least treat him with a sense of respect.

source: 他的心情一下子就变得极差。
en_us: His mood immediately took a nosedive.

source: 他瞥见少年手中的泥土，略作停顿，促狭道：“就是面朝黄土背朝天的命了。”
en_us: He paused momentarily as he spotted the dirt in Chen Ping'an's hand, then continued in a menacing fashion, "Then you're going to be buried in the dirt before long."

source: 他知道蔡金简死定了，这里不是仙气缭绕的神仙洞府云霞山，此处是术法禁绝的天道牢笼，除非出现一位修为通天的陆地神仙，或是金身罗汉，愿意拿大半修为来换取她的性命，才有可能镇压住魂魄，帮她起死回生。很可惜蔡金简绝对不会有这样的泼天福缘，小镇上那位圣人身负重任，俯瞰苍生，绝不会厚此薄彼，只会顺势而为。
en_us: He knew that there was no saving Cai Jinjian. This wasn't the Dawn Cloud Saint, where immortal energy was available in great abudance. This was an immortal prison where all mystical abilities were restricted, and the only way that she could be saved would be if an almighty Terrestial God or a golden arhat were willing to sacrifice a majority of their cultivation base to capture her soul and revive her from the dead. Unfortunately for Cai Jinjian, such a massive blessing was not goin to fall upon her. The Sage in the town had a very important duty, resembling a deity that ruled over the town, and there was no way that he would interfere with the natural order just to save someone's life.

source: 他离开福禄街的官邸后，途径十二脚牌坊楼，停下脚步，仰头望着“当仁不让”四字匾额。
en_us: After leaving his residence on Fortune Street, he stopped while passing by the stone archway, then looked up at the plaque that bore the idiom "doing my part".

source: 他突然惊讶出声，便停下话语，瞬间来到少女身边，一探究竟，双指轻轻握住刀尖。
en_us: All of a sudden, a hint of surprise appeared on Qi Jingchun's face, and his voice abruptly cut off as he instantly arrived by the young woman's side before gently gripping onto the tip of her saber between two of his fingers.

source: 他突然有些犹豫，对她的杀心开始摇摆不定，是不是与之成为一双神仙美眷，会更有利于老龙城势力北上的谋划？蔡金简一旦在此成功获得机缘，回到山门后，地位势必水涨船高，运作得当，甚至不是没有机会成为云霞山的女主人，在历史悠久的云霞山祖谱上，也不是没有女子当家的先例。如此一来，老龙城就等于有了一块跳板，名正言顺渗透东宝瓶洲的腹地版图，从此南北呼应，进可攻退可守，正是王霸基业，使得老龙城摆脱空有实力、却只能偏安割据的尴尬局面，数百年来饱受排斥之苦。
en_us: He suddenly found himself feeling a little hesitant, and his conviction to kill her began to falter. If he could take her as his Dao partner, wouldn't that help the Old Dragon City extend its infuence toward the north? If Cai Jinjian could successfully obtain her fated opportunity here, her status would undoubtedly be severely elevated once she returned to the Dawn Cloud Mountain, and it certainly wasn't a stretch to think that she could become the mistress of the Dawn Cloud Mountain. Throughout the extensive history of the Dawn Cloud Mountain, there had been precedents of women becoming the master of the mountain. If everything went according to plan, the Old Dragon City would have a legitimate reason to infiltrate the central area of the Eastern Treasured Vial Continent, forming an alliance with the Dawn Cloud Mountain in the north. For the past several centuries, the Old Dragon City had always been an extremely powerful sect, but it was constantly being ostracized and shunned by other powers due to its terrible geographic location. If this pitfall could be addressed, then the Old Dragon City's potential for future growth would be truly limitless.

source: 他突然看到一个风一般的灵巧身影，从自己身边擦肩而过，是个身穿大红棉袄的小女孩，让人哭笑不得是小闺女肩膀上，扛着一根粗如青壮手臂的槐枝，槐枝等人长，小女孩脚步飞快，跟车轱辘似的，活泼俏皮得很。
en_us: All of a sudden, a short and spiritely figure blew past him like the wind. It was a little girl wearing a large padded jacket, and what was quite amusing was that she was carrying a branch as thick as a young man's arm on her shoulder. The branch was as long as she was tall, and she was rushing along so quickly that it was as if there were wheels attached to her feet.

source: 他突然笑了起来，模仿少女说话的口气，“老气横秋”道：“听不听，是你的自由，说不说，就是我的事情了。”
en_us: A smile suddenly appeared on his face as he imitated the young woman's feigned demeanor of maturity and said, "Whether you listen to me or not is up to you, but what I say is up to me."

source: 他突然闭上嘴巴，有些惊讶，片刻后，孩子的脸色已经从震惊变成茫然，再然后，孩子开始恐惧，猛然回过神，一下子跳下井口，往自己家逃去。
en_us: A short while later, the expression on his face had already turned from astonishment to confusion, and after that, a fearful look began to appear in his eyes. All of a sudden, he snapped back to his senses and jumped down from the edge of the well before fleeing toward his home.

source: 他站起身问道：“不管大小，眼前也算是剑炉的一种？”
en_us: He stood up and asked, "Regardless of whether it's big or small, is the remaining stance of this statue also a type of Sword Furnace?"

source: 他笑问道：“你们之间有仇？”
en_us: Hence, he smiled as he asked, "Is there some bad blood between you two?"

source: 他脸色阴沉，用正统的雅言官话提醒她：“蔡金简，请你三思而后行，如果你接下来还是这么冲动，我觉得有必要放弃盟约，我不想被你害得竹篮打水一场空。”
en_us: A stern look appeared on his face as he said in an authentic official dialect, "Please think before you act, Cai Jinjian. If you continue to be so reckless, I will be inclined to terminate our collaboration. I don't want to have my plans foiled by your reckless actions."

source: 他腰间悬挂两只袋子，装着满满当当的圆状物体。
en_us: There was a pair of pouches hanging from the man's waist, and those pouches were filled with a collection of round objects.

source: 他见这位小主人好像没有听明白自己的言下之意，只得更加直白说道：“殿下，小巷此人在此地，已经有可能对殿下造成威胁。”
en_us: It seemed that the young boy hadn't comprehended what he was implying, so he could only offer a more direct and straightforward explanation to elaborate. "Your Highness, what I'm trying to say is that in this setting, that woman can pose a potential threat to you."

source: 他让陈平安等着，大踏步走向屋子，回来的时候，手里多了一摞信封，不厚不薄，约莫十来份，汉子递给陈平安后，问道：“傻人有傻福，好人有好报。你信不信？”
en_us: The gatekeeper asked Chen Ping'an to wait outside as he made his way into the cabin, then re-emerged with a stack of letters in his hand. It wasn't a particularly thick stack, consisting of only around 10 letters, and the man handed the letters over to Chen Ping'an before asking, "It's said that fortune favors the foolish, and karma favors the righteous. Do you believe in that?"

source: 他记起一事，从地上找出一块棱角分明的石头，问道：“阮姑娘，我能不能问你有些字是什么意思，怎么个读法？”
en_us: All of a sudden, a thought occurred to him, and he picked up a sharp rock from the ground, then asked, "Ruan Xiu, can I ask you about the meanings and pronunciations of some characters?"

source: 他走出一步。
en_us: He took a step forward, and he instantly arrived next to the Dragon Slaying Platform.

source: 他走到宋集薪家院门口的时候，听到吱呀一声，屋门打开，陈平安只得装模作样去敲自家门，喊道：“宁姑娘，睡了吗，我回来拿点东西。”
en_us: When he arrived outside Song Jixin's courtyard door, he heard the creak of a door being opened. Chen Ping'an had no option but to knock on his own door and shout, "Ning Yao, have you slept yet? I came back to get something."

source: 他跟陈平安说了一句话后，没过多久，陈平安就离开了小镇，违背他娘亲去世时答应的誓言，小小年纪就去龙窑当起了学徒。
en_us: He said something to Chen Ping'an, and after a few days, Chen Ping'an left the small town and broke his promise with his deceased mother. He was still very young, but he had already gone to the dragon kiln to become an apprentice.

source: 他蹲下身放下脸盆，坐在床边，握住高大少年已经微凉的手，挤出一个比苦还难看的笑脸，轻声道：“我会回来的。”
en_us: He squatted down to place the basin onto the ground, then sat down onto the side of the bed, gripping onto Liu Xianyang's hand, which had already turned slightly cold, and he put on a smile that was even more hideous than a grimace as he said in a quiet voice, "I'll be back."

source: 他转头对自家丫鬟笑道：“稚圭，咱们走！去给你买一整个将军肚子罐的桃花粉。”
en_us: He then put on a smile as he turned to Zhi Gui and said, "Let's Go, Zhi Gui. I'll buy you a whole temple jar of peach blossom powder."

source: 他迅速环顾四周，继续前行，再往前就是宋家，宋家过后便是窑务监造衙署了，在李宋两家毗邻的大宅交界处的外墙，生长有一棵槐树，老干虬枝，枝繁叶茂，虽然比不得小镇那棵老槐沧桑气象，但也让人一见不俗。
en_us: He quickly inspected his surroundings. Going beyond this point would take him to the Song Clan's manor, beyond which was the office of the kiln supervision official. There was a locust leaf growing outside the wall at the point where the Li and Song manors met. The tree was quite large and lush, and even though it wasn't as impressive a sight as the renowned old locust tree of the town, it was still quite spectacular in its own right.

source: 他还有些驼背，对那个小镇看门人没好气道：“师父愿意跟你说超出十个字的话，我跟你姓。”
en_us: He was also a little hunch-backed, and he turned to the gatekeeper as he grumbled, "Zheng Dafeng, I'll take on your surname if our master is ever willing to say more than 20 words to you at a time!"

source: 他问道：“是谁教你的刀法和剑术？”
en_us: He then asked, "Who taught you your sword and saber techniques?"

source: 仙人双指一往无前，毫无悬念地洞穿齐静春法相的胳膊，来自窟窿的金色巨人那一拳，更是结结实实砸在齐静春法相的头颅之上。
en_us: The fingers of the immortal continued onward with unstoppable force, piercing through the arm of Qi Jingchun's Dao Manifestation with ease, while the fist of the golden giant crashed heavily down upon Qi Jingchun's head, leaving his Dao Manifestation swaying unsteadily, looking as if it could fall at any moment.

source: 以前听宋集薪说过yi句话，跟宁姑娘的“读书百遍”差不多意思，叫读书破万卷，下笔如有神。
en_us: Song Jixin had said something similar to "the meaning of a book will become clear if you read it many times" before, and the saying had gone, "the more one reads, the better one writes".

source: 以前小镇西边这些座巷子，应该就只有顾粲他娘亲，能够压得住马婆婆的气焰。如今顾寡妇据说跟着她那死鬼男人的远房亲戚，投奔了夫家的家乡，这些年原本已经稍稍慈眉善目一些的马婆婆，立即就生龙活虎、重返江湖了，逮着谁都瞧不顺眼，这不宋集薪的婢女来这么一出，马婆婆立即就开始阴阳怪气说话，嗓门不大，皮笑肉不笑，故意跟身边妇人拉家常，说有些姑娘家家的，总算可以开脸绞面啦，反正走起路来双腿都没法子并拢了，这是大喜事，终于不用小姐身子丫鬟命，可以光明正大被人喊夫人喽。
en_us: In the past, there was most likely only a single person in this alley to the west of the small town who could suppress Granny Ma's ferocity — Gu Can's mother. Now, however, it was rumored that the widow had left with a distant relative of her dead husband and would settle in her husband's home town. Granny Ma had already become slightly kinder these years, yet following the departure of Gu Can's mother, she immediately became lively and ferocious again, returning to her old self. It was as if everyone was an eyesore to her. Indeed, upon seeing Zhi Gui cutting the line, Granny Ma immediately started to speak strangely. Her voice wasn't loud, and a fake smile was stretched across her face. She purposefully chit-chatted with the woman next to her, saying that there were some girls who could finally lift their veil and make their relationship public. In any case, she had never been able to keep her legs together when walking anyway. This was a cause for celebration, as this girl finally didn't need to suffer the fate of a lowly maidservant. She could now be referred to as a missus.

source: 以前李槐很厌烦齐先生的规矩，如今倒是怀念起齐先生的好了。
en_us: In the past, Li Huai had always been very annoyed by all of the rules set by Mr. Qi, but now, he was beginning to miss him.

source: 以前陈平安是刘羡阳屁股后头的跟屁虫，跟着刘羡阳抓鱼捕蛇掏鸟窝，陈平安成为少年之后，自己身后也多出一个小跟班了。
en_us: In the past, Chen Ping'an had been a little kid who would follow Liu Xianyang around everywhere. He would follow him to fish, catch snake, and steal eggs from bird nests. After he became a young boy, he had also ended up with a little kid who would follow him everywhere.

source: 以后恐怕就只能在大骊皇宫秘史里去找了。
en_us: In the future, information about this small world could perhaps only be found in the secret imperial history books of the Great Li Empire.

source: 以后隋朝说不定会有位勤俭皇帝
en_us: It seemed that the Great Sui Nation was going to have a very miserly and conservative emperor in the future.

source: 以梦境为剑炉。
en_us: Using his sleep and dreams as a Sword Furnace.

source: 以至于苻南华在他身后的言语，少年也未听清楚。
en_us: Song Jixin was so caught up in his own thoughts that he failed to hear what Fu Nanhua was saying behind him, and thus, Fu Nanhua was forced to repeat himself. "Song Jixin, did you know that there's a type of people in this world that are completely different from the likes of you and that boy?"

source: 以至于陈平安经过一间骑龙巷铺子的时候，破天荒花钱买了一串糖葫芦，边走边吃。
en_us: He was so elated by this realization that for the first time ever, he bought a tanghulu from a shop on Dragon Riding Alley to eat on the way home.

source: 仰着脑袋的少年嗯了一声，笑容腼腆，轻声道：“是很巧。”
en_us: A bashful smile appeared on Chen Ping'an's face as he replied, "It really is quite the coincidence."

source: 仿佛人间这一遭，算是真正走完了。
en_us: Its journey in this world had come to an end.

source: 仿佛声声春雷，在福禄街和桃叶巷上空滚滚响动，“够了不许对齐先生不敬，而且我阮某人也绝不会在春分之前，涉足小镇事务”
en_us: A voice that resembled rumbling thunder instantly rang out above Fortune Street and Peach Leaf Alley. "That's enough! You are not to disrespect Mr. Qi, and I will not interfere in the matters of the town before Chunfen arrives." [ref]Chunfen is another one of the 24 solar terms on the traditional Chinese calendar.[/ref]

source: 众说纷纭，老人们争来争去，以至于听故事的孩子们谁也不愿意当真。
en_us: The old people in the town were constantly arguing over who had the correct details in their story, and due to the conflicting accounts, none of the children were willing to believe that such a creature truly existed.

source: 伙计犹豫片刻，没有纠缠，领着他们来到后院正屋，一位老人正在用老烟杆子轻轻磕着桌面，屋子角落远远站着一位邋遢汉子，正是小镇东边的看门人，光棍郑大风，可能是一物降一物，郑大风碰到了杨老头，便是大气不敢喘的模样，再无平时油滑无赖的欠打德行。
en_us: The shop assistant hesitated for a moment before deciding to lead them to the building in the backyard. An old man was lightly tapping the table with his smoking pipe, and there also stood a disheveled man in a distant corner in the room. This disheveled man was none other than the single Zheng Dafeng, the gatekeeper for the eastern gate of the small town. Perhaps this was a case of everyone having their vanquisher, with Zheng Dafeng not even daring to breath too heavily in the presence of Old Man Yang. He no longer appeared like a punchable scoundrel.

source: 伞下少年看不清表情，抬起手臂做了一个动作后，少年应了一声婢女的招呼，终于开始加快前行。
en_us: Song Jixin's expression was hidden under his umbrella. After raising an arm and completing some action, he answered Zhi Gui's call and finally started to walk quicker.

source: 传闻小镇曾经有好事者，试图检验铁链到底有多长，不顾老人们的劝阻，对于“拽铁锁出井口者，每出一尺，折寿一年”，这条口口相传的老规矩，那人根本没当回事，结果使劲拉扯了一炷香后，拔出一大堆铁链，仍是没有看到尽头的迹象，那人已是精疲力尽，便任由那些拽出井口的铁链，盘曲在水井轱辘旁，说是明天再来，他就偏偏不信这个邪了。此人回到家后，当天便七窍流血，暴毙在床上，而且死不瞑目，不管家人如何费劲折腾，尸体就是闭不上眼睛，最后有一个世世代代住在水井附近的老人，让那户人家抬着尸体到水井旁边，“眼睁睁”看着老人将那些铁链放回水井，等到整条铁链重新笔直没入井口深水中，那具尸体终于闭眼了。
en_us: It was said that there was once a curious individual in the town who wanted to examine just how long the chain was. The old people in the town warned them that those who tried to pull the chain out of the well would have one year shaved off their lifespan with each foot of chain that was pulled, but the man paid no heed to the ominous warning. After tugging vigorously on the chain for 15 minutes, a huge pile of it had been pulled out, but there was still no end in sight. At that point, the man was already completely exhausted, and he left the pile of chain next to the well winch, proclaiming that he was going to be back the next day, and that he was determined to get to the bottom of this mystery. However, on the very same day after he returned home, he died on his bed, bleeding out of all of his orifices, and he refused to close his eyes in death. No matter what his family members tried, they were unable to get his corpse to close its eyes. In the end, an old man whose family had lived near the well for generations instructed that family to carry the corpse over to the well so that it could "watch" the old man return the chain back into the well. Finally, after the entire chain had sunk down into the depths, the body finally closed its eyes.

source: 估摸着她是在显摆自己牙齿又长齐了。
en_us: She was most likely showing off the fact that her tooth had regrown again.

source: 伴随着这位天上仙人的话语，仿佛有阵阵雷声迅猛滚走于云海之中，那些一闪即逝的电闪雷鸣，不断从云海底端渗透而出。
en_us: Accompanying this celestial immortal's voice were bursts of rumbling thunderclaps ringing out within the clouds, as well as brief flashes of lightning.

source: 伸手将云海搅出一个大窟窿的仙人肆意大笑，“哈哈，姓齐的，你是真不知道缘由，还是装疯卖傻？”
en_us: The immortal who had just punched a hole through the clouds immediately burst into laughter. "Do you really not know the reasons behind this, or are you just playing dumb?"

source: 似乎是发现眼前男人根本不信，于是宋集薪收敛脸上浮夸做作的神色，率先在大堂椅子上落座，伸手示意苻南华也坐下，然后认真说道：“我跟隔壁很小就没了父母的陈平安，当了这么多年邻居，从来没吵过架，信不信由你。”
en_us: He then seemed to have realized that his act wasn't fooling Fu Nanhua at all, so he abandoned his exaggerated display of feigned surprise, and he sat down onto a chair in the room before extending a hand, inviting Fu Nanhua to also take a seat. After that, a serious look appeared on his face as he said, "The name of the boy from the neighboring house is Chen Ping'an, and he lost his parents at a very young age. Even though we've been neighbors for many years, we haven't had even a single argument. You may not believe me, but that's up to you."

source: 似乎被这个问题勾起了心思。
en_us: It was as if this question stirred up something in the young boy's mind.

source: 但其实谁都看得出来他的开怀。
en_us: In reality, however, nothing could wipe the happiness from his face.

source: 但如果放在外边，恰恰相反，实则是卢氏垫底，源于由卢氏主支当国执政的一个王朝，被大骊两大边军联手覆灭后，卢氏在东宝瓶洲的地位，已是岌岌可危。
en_us: If one were to take into account the outside world, however, things would be the complete opposite. In reality, the Lu Clan was the weakest of all the clans. This was because the empire supported by the Lu Clan had been annihilated by two armies from the Great Li Empire. As a result, their standing in the Eastern Treasured Vial Continent was now extremely precarious.

source: 但是一瞬间过后，少女整个人像是被重物砸断了浑身骨肉，一滩烂泥般瘫在地上，无比凄惨。
en_us: However, in the next instant, Zhi Gui collapsed to the ground like a pile of mud, looking as if every single bone in her body had just been shattered by a heavy object, presenting an extremely sorry sight to behold.

source: 但是一阵火烧滚烫，一阵冰冷打摆子。孩子最后只能疼得在小巷子里打滚。
en_us: However, his body was fluctuating drastically in temperature, leaving him as hot as a chunk of burning coal one moment, only to be shivering from intense cold the next. In the end, he could only roll around in the alley in agony.

source: 但是下一刻，只是多看了老剑条这一眼的河婆老妪，一双眼珠子当场爆裂。
en_us: However, in the next instant, her eyeballs suddenly exploded, all because her gaze had lingered on the old sword billet for a moment too long.

source: 但是下一刻，苻南华就沉声喝道：“蔡金简，住手！”
en_us: However, in the next instant, the amusement on his face immediatley faded, and he yelled, "Stop!"

source: 但是事实真相如何，是当局者迷，旁观者未必清。
en_us: However, regarding the truth of the matter, those who were close to the situation might be mystified, but those who were observing from the distance wouldn't necessarily be able to see things clearly either.

source: 但是卢正淳能够很确定一件事，就是他无比希望刘羡阳死在这里。
en_us: However, there was one thing that Liu Xianyang knew for certain, which was that he wanted nothing more than to see Liu Xianyang die here.

source: 但是在那之后，刘羡阳非但没有感激那个救了自己命的孩子，反而隔三差五就来这边捉弄戏耍，孤儿也倔，不管刘羡阳如何欺负，就是不肯哭，让少年愈发愤懑。只是后来有一年，刘羡阳眼见着那个姓陈的小孤儿，估计是实在扛不过冬天的样子，终于良心发现，已经在龙窑拜师学艺的少年，便带着孤儿去往那座位于宝溪边上的龙窑，出了小镇往西走，大雪天的几十里山路，刘羡阳到现在还是没有想明白，那个长得跟木炭似的小家伙，两条腿分明细得跟毛竹竿子差不多，是怎么走到龙窑的？不过老姚头虽然最后还是留下了陈平安，但对待两人，确实天壤之别，对关门弟子刘羡阳，也打也骂，但瞎子也感受得到其中的良苦用心，例如有次下手重了，砸得刘羡阳额头渗出血来，少年皮糙肉厚没觉得有什么，反而是当师傅的老姚头，很是后悔了，这个在徒弟面前威严惯了的闷葫芦老头，碍于面子不好说什么，结果在自家屋子里兜圈子兜了大半夜，仍是不放心刘羡阳，最后只得喊来陈平安，给刘羡阳送去了一瓶药膏。
en_us: However, after that incident, not only was Liu Xianyang not grateful to the child that saved his life, he regularly came over to bully the child instead. The child was an orphan, and he was very stubborn, refusing to cry no matter how much he was bullied, something that only served to further infuriate Liu Xianyang. One year, Liu Xianyang could tell that the little orphan most likely wasn't going to be able to make it through the winter, and he was finally stung by his conscience. Having already become a disciple of Old Man Yao's at the time, he took the young boy to the dragon kiln that was situated beside Treasure Creek. They headed west out of the town, traveling over dozens of kilometers of rugged mountain terrain under heavy snowfall. To this day, Liu Xianyang still couldn't understand how the emaciated young boy with a pair of legs as thin as baby bamboo shoots had managed to walk all the way to the dragon kiln. Even though Old Man Yao ultimately took in Chen Ping'an, the disparity in his treatment of the two boys was night and day. Even as his best disciple, Liu Xianyang wasn't spared from his beatings and insults, but even a blind man could sense the good intentions behind Old Man Yao's words and actions. For example, there was one time when he went a little too far, inflicting a bleeding gash onto Liu Xianyang's forehead. As a tough young boy, Liu Xianyang didn't think much of this, but Old Man Yao was feeling very remorseful over his actions. However, he had always kept up a stern and authoritative facade in front of his disciples, so he couldn't bring himself to apologize or enquire about his condition. In the end, he paced back and forht in his own room for almost an entire night, and he was still concerned about Liu Xianyang. Finally, he had no choice but to call over Chen Ping'an to deliver a bottle of ointment to Liu Xianyang.

source: 但是女子嗯了一声，淡然道：“宋长镜确实有这个资格，我没有不服气，只是心有不甘而已。”
en_us: The woman nodded calmly in response. "Song Changjing is a man worthy of my respect. I'm not feeling angry, I'm just disappointed in myself."
